ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_glb_gpio.c
            case GLB_GPIO_FIFO_INT_END:
                tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CR_GPIO_TX_END_MASK);
                break;

            case GLB_GPIO_FIFO_INT_ALL:
                tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CR_GPIO_TX_END_MASK);
                tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CR_GPIO_TX_FIFO_MASK);
                tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CR_GPIO_TX_FER_MASK);
                break;

            default:
                break;
        }
    }

    /* Write back */
    BL_WR_REG(GLB_BASE, GLB_GPIO_CFG143, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Clear GPIO fifo interrupt
 *
 * @param  intType: interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_GPIO_Fifo_IntClear(GLB_GPIO_FIFO_INT_Type intType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_GLB_GPIO_FIFO_INT_TYPE(intType));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPIO_CFG143);

    /* Clear certain or all interrupt */
    switch (intType) {
        case GLB_GPIO_FIFO_INT_FER:
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPIO_TX_FIFO_CLR);
            break;

        case GLB_GPIO_FIFO_INT_FIFO:
            //tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPIO_TX_FIFO_CLR);
            break;

        case GLB_GPIO_FIFO_INT_END:
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPIO_TX_END_CLR);
            break;

        case GLB_GPIO_FIFO_INT_ALL:
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPIO_TX_FIFO_CLR);
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPIO_TX_END_CLR);
            break;

        default:
            break;
    }

    /* Write back */
    BL_WR_REG(GLB_BASE, GLB_GPIO_CFG143, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get GPIO fifo interrupt status
 *
 * @param  intType: interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Sts_Type GLB_GPIO_Fifo_GetIntStatus(GLB_GPIO_FIFO_INT_Type intType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_GLB_GPIO_FIFO_INT_TYPE(intType));

    /* Get certain or all interrupt status */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPIO_CFG143);

    if (GLB_GPIO_FIFO_INT_ALL == intType) {
        if (BL_IS_REG_BIT_SET(tmpVal, GLB_R_GPIO_TX_END_INT) ||
            BL_IS_REG_BIT_SET(tmpVal, GLB_R_GPIO_TX_FIFO_INT) ||
            BL_IS_REG_BIT_SET(tmpVal, GLB_R_GPIO_TX_FER_INT)) {
            return SET;
        } else {
            return RESET;
        }
    } else {
        switch (intType) {
            case GLB_GPIO_FIFO_INT_FER:
                return BL_IS_REG_BIT_SET(tmpVal, GLB_R_GPIO_TX_FER_INT);

            case GLB_GPIO_FIFO_INT_FIFO:
                return BL_IS_REG_BIT_SET(tmpVal, GLB_R_GPIO_TX_FIFO_INT);

            case GLB_GPIO_FIFO_INT_END:
                return BL_IS_REG_BIT_SET(tmpVal, GLB_R_GPIO_TX_END_INT);

            default:
                return RESET;
        }
    }
}
BL_Sts_Type GLB_GPIO_Fifo_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPIO_CFG142);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_CR_GPIO_TX_EN);
    BL_WR_REG(GLB_BASE, GLB_GPIO_CFG142, tmpVal);

    return SUCCESS;
}
BL_Sts_Type GLB_GPIO_Fifo_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPIO_CFG142);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CR_GPIO_TX_EN);
    BL_WR_REG(GLB_BASE, GLB_GPIO_CFG142, tmpVal);

    return SUCCESS;
}

/*@} end of group GLB_GPIO_Public_Functions */

/*@} end of group GLB_GPIO */

/*@} end of group BL606P_Peripheral_Driver */
